vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G45x_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.37" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.37/schema/PACK.xsd">
    <vendor>NSING</vendor>
    <url>https://www.nsing.com.sg/public/uploads/armpacks/</url>
    <name>N32G45x_DFP</name>
    <description>Nsing N32G45x Series Device Support, Drivers and Examples</description>

    <releases>
		<release date="2024-08-14" version="1.0.7">		    
            First release of N32G45x_DFP
        </release>
    </releases>

    <keywords>
        <keyword>NSING</keyword>
        <keyword>Device Support</keyword>
        <keyword>N32G45x</keyword>
		<keyword>N32</keyword>
    </keywords>

    <devices>
        <family Dfamily="N32G45x Series" Dvendor="NSING:185">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian"/>
          <description>
The N32G45x series utilizes a 32-bit ARM Cortex-M0 core with operating frequency up to 48MHz. 

- Up to 64KB embedded encrypted Flash memory.
- 16KB SRAM.
- 1x 12bit 1Msps ADC and 1x high-speed comparators
- 4x USART, 2x LPUART, 2x I2C, 3x SPI, 1x OPAMP, 1x OPA and 2x Beeper	
- 1x CAN, TSC
- Hardware Cryptographics Engine.
          </description>
  
          <subFamily DsubFamily="N32G451">
		   <processor Dclock="144000000"/>		   
           <compile header="firmware/CMSIS/device/n32g45x.h" define="N32G45x USE_STDPERIPH_DRIVER"/>
	  	   <feature type="XTAL"     n="4000000"     m="48000000" name="Internal RC Oscillator"/>		   
	  	   <feature type="VCC"      n="1.80"        m="5.50"/>		
		   <feature type="Temp"     n="-40"        m="105"/>	
		   <feature type="RTC"      n="1"/>		   
		  <!-- *************************  Device 'N32G451CBL7'  ***************************** -->
		  <device Dname="N32G451CBL7"> 
			<description>
- Package:LQFP48
- LCD Module			
			</description>				
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="48" 		name="48KB SRAM"/>	
			<feature type="IOs"      n="37"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="23"/>				
			<feature type="ADC"      n="3"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="3"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="CAN"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0xC000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G451.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G451CCL7'  ***************************** -->
		  <device Dname="N32G451CCL7"> 
			<description>
- Package:LQFP48
- LCD Module			
			</description>				
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="96" 	name="96KB SRAM"/>	
			<feature type="IOs"      n="37"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="23"/>				
			<feature type="ADC"      n="3"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="3"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="CAN"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x1800" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G451.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G451CEL7'  ***************************** -->
		  <device Dname="N32G451CEL7"> 
		  	<description>
- Package:LQFP48
- LCD Module			
			</description>				
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="96" 	name="96KB SRAM"/>	
			<feature type="IOs"      n="37"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="23"/>				
			<feature type="ADC"      n="3"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="3"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="2"/>
			<feature type="USBD"     n="1"/>				
			<feature type="CAN"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x1800" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G451.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G451RBL7'  ***************************** -->
		  <device Dname="N32G451RBL7"> 
		  	<description>
- Package:LQFP64
- LCD Module			
			</description>				
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="48" 	name="48KB SRAM"/>	
			<feature type="IOs"      n="51"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="3"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>
			<feature type="USBD"     n="1"/>				
			<feature type="CAN"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0xC000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G451.svd"/>
          </device>	
