vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G45x_DFP.pdsc
		 <!-- *************************  Device 'N32G451RCL7'  ***************************** -->
		  <device Dname="N32G451RCL7"> 
		  	<description>
- Package:LQFP64
- LCD Module			
			</description>				
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="96" 	name="96KB SRAM"/>	
			<feature type="IOs"      n="51"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="3"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>
			<feature type="USBD"     n="1"/>				
			<feature type="CAN"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x18000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G451.svd"/>
          </device>		
		 <!-- *************************  Device 'N32G451REL7'  ***************************** -->
		  <device Dname="N32G451REL7"> 
		  	<description>
- Package:LQFP64
- LCD Module			
			</description>				
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="96" 	name="96KB SRAM"/>	
			<feature type="IOs"      n="51"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="3"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>
			<feature type="USBD"     n="1"/>				
			<feature type="CAN"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x18000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G451.svd"/>
          </device>		
		 <!-- *************************  Device 'N32G451VCL7'  ***************************** -->
		  <device Dname="N32G451VCL7"> 
		  	<description>
- Package:LQFP100
- LCD Module			
			</description>				
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="96" 	name="96KB SRAM"/>	
			<feature type="IOs"      n="80"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="3"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>
			<feature type="USBD"     n="1"/>				
			<feature type="CAN"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x18000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G451.svd"/>
          </device>		
		 <!-- *************************  Device 'N32G451VEL7'  ***************************** -->
		  <device Dname="N32G451VEL7"> 
		  	<description>
- Package:LQFP100
- LCD Module			
			</description>				
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="96" 	name="96KB SRAM"/>	
			<feature type="IOs"      n="80"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="3"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>
			<feature type="USBD"     n="1"/>				
			<feature type="CAN"      n="1"/>			
			
			<memory id="IRAM1"   start="0x20000000" size="0x18000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G451.svd"/>
          </device>		
		  
		    </subFamily>
          <subFamily DsubFamily="N32G452">
                <processor Dclock="144000000"/>
                <description>
Up to 144MHz ARM Cortex-M4F, 512KB Flash, 144KB SRAM, 7xU(S)ART, 4xI2C, 3xSPI, 1xQSPI, USB 2.0 FS Device, RTC, 2x 12bit 5Msps ADC, 2x12bit DAC, Hardware Cryptographic Engine.
                </description>				
                <compile header="firmware/CMSIS/device/n32g45x.h" define="N32G45X N32G452 USE_STDPERIPH_DRIVER"/>
		 <!-- *************************  Device 'N32G452CBL7'  ***************************** -->
		  <device Dname="N32G452CBL7"> 
		  	<description>
- Package:LQFP48
- QSPI: 1x	
- LCD Module	
			</description>			  
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="80" 	name="80KB SRAM"/>	
			<feature type="IOs"      n="37"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="23"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>				
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="3"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="3"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x14000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G452.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G452CCL7'  ***************************** -->
		  <device Dname="N32G452CCL7"> 
		  	<description>
- Package:LQFP48
- QSPI: 1x	
- LCD Module	
			</description>			  
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="37"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="23"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="3"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="3"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G452.svd"/>
          </device>	
