vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G45x_DFP.pdsc
		 <!-- *************************  Device 'N32G452CEL7'  ***************************** -->
		  <device Dname="N32G452CEL7"> 
		  	<description>
- Package:LQFP48
- QSPI: 1x	
- LCD Module	
			</description>			  
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="37"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="23"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="3"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="3"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G452.svd"/>
          </device>	
		 <!-- *************************  Device 'N32G452RBL7'  ***************************** -->
		  <device Dname="N32G452RBL7"> 
		  	<description>
- Package:LQFP64
- QSPI: 1x	
- LCD Module	
			</description>			  
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="80" 	name="80KB SRAM"/>	
			<feature type="IOs"      n="51"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x14000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G452.svd"/>
          </device>				
		 <!-- *************************  Device 'N32G452REL7'  ***************************** -->
		  <device Dname="N32G452REL7"> 
		  	<description>
- Package:LQFP64
- QSPI: 1x	
- LCD Module	
			</description>			  
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="51"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G452.svd"/>
          </device>				
		 <!-- *************************  Device 'N32G452MBL7'  ***************************** -->
		  <device Dname="N32G452MBL7"> 
		  	<description>
- Package:LQFP64
- QSPI: 1x	
- LCD Module	
			</description>			  
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="51"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G452.svd"/>
          </device>				
		 <!-- *************************  Device 'N32G452MCL7'  ***************************** -->
		  <device Dname="N32G452MCL7"> 
		  	<description>
- Package:LQFP80
- QSPI: 1x	
- LCD Module	
			</description>			  
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="67"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G452.svd"/>	 
          </device>				
		 <!-- *************************  Device 'N32G452MEL7'  ***************************** -->
		  <device Dname="N32G452MEL7"> 
		  	<description>
- Package:LQFP80
- QSPI: 1x	
- LCD Module	
			</description>			  
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="67"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G452.svd"/>	
          </device>				
		 <!-- *************************  Device 'N32G452VCL7'  ***************************** -->
		  <device Dname="N32G452VCL7"> 
		  	<description>
- Package:LQFP100
- QSPI: 1x	
- LCD Module	
			</description>			  
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="80"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G452.svd"/>	
          </device>				
		 <!-- *************************  Device 'N32G452VEL7'  ***************************** -->
		  <device Dname="N32G452VEL7"> 
		  	<description>
- Package:LQFP100
- QSPI: 1x	
- LCD Module	
			</description>			  
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="80"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G452.svd"/>	
          </device>				
		 <!-- *************************  Device 'N32G452QCL7'  ***************************** -->
		  <device Dname="N32G452QCL7"> 
		  	<description>
- Package:LQFP128
- QSPI: 1x	
- LCD Module	
			</description>			  
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="97"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G452.svd"/>	
          </device>	
		 <!-- *************************  Device 'N32G452QEL7'  ***************************** -->
		  <device Dname="N32G452QEL7"> 
		  	<description>
- Package:LQFP128
- QSPI: 1x	
- LCD Module	
			</description>			  
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="97"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="2"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G452.svd"/>	
          </device>		 
		  
        </subFamily>

          <subFamily DsubFamily="N32G455">
                <processor Dclock="144000000"/>
                <description>
Up to 144MHz ARM Cortex-M4F, 512KB Flash, 144KB SRAM, 7xU(S)ART, 4xI2C, 3xSPI, 1xQSPI, USB 2.0 FS Device, RTC, 4x 12bit 5Msps ADC, 2x12bit DAC, 4xOPAMP, 7xComp, up to 24 Channels TSC, Hardware Cryptographic Engine.
                </description>				
                <compile header="firmware/CMSIS/device/n32g45x.h" define="N32G45X N32G455 USE_STDPERIPH_DRIVER"/>
		 <!-- *************************  Device 'N32G455TBQ7'  ***************************** -->
		  <device Dname="N32G455TBQ7"> 
		  	<description>
- Package:QFN36
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 7x		
			</description>			  
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="80" 	name="80KB SRAM"/>	
			<feature type="IOs"      n="26"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="23"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="2"/>	
			<feature type="UART"     n="1"/>	
		    <feature type="SPI"      n="1"/>	
			<feature type="I2C"      n="2"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x14000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>	
		 <!-- *************************  Device 'N32G455CBL7'  ***************************** -->
		  <device Dname="N32G455CBL7"> 
		  	<description>
- Package:LQFP48
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 5x		
- TSC: 8x	
			</description>			  
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="80" 	name="80KB SRAM"/>	
			<feature type="IOs"      n="37"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="23"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="3"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="3"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x14000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>			  
		 <!-- *************************  Device 'N32G455CCL7'  ***************************** -->
		  <device Dname="N32G455CCL7"> 
		  	<description>
- Package:LQFP48
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 5x		
- TSC: 8x	
			</description>			  
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="37"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="23"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="3"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="3"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>			  
		 <!-- *************************  Device 'N32G455RBL7'  ***************************** -->
		  <device Dname="N32G455RBL7"> 
		  	<description>
- Package:LQFP48
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 5x		
- TSC: 8x	
			</description>			  
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="37"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="23"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="3"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="3"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>	
		 <!-- *************************  Device 'N32G455RCL7'  ***************************** -->
		  <device Dname="N32G455RCL7"> 
		  	<description>
- Package:LQFP64
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 7x		
- TSC: 16x	
			</description>			  
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="51"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="23"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="USBD"     n="1"/>
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>	
		 <!-- *************************  Device 'N32G455CEQ7'  ***************************** -->
		  <device Dname="N32G455CEQ7"> 
		  	<description>
- Package:QFN48
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 7x		
- TSC: 16x	
			</description>			  
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="51"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="3"/>	
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>	
		 <!-- *************************  Device 'N32G455REL7'  ***************************** -->
		  <device Dname="N32G455REL7"> 
		  	<description>
- Package:LQFP64
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 7x		
- TSC: 16x	
			</description>			  
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="51"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>	
		 <!-- *************************  Device 'N32G455MBL7'  ***************************** -->
		  <device Dname="N32G455MBL7"> 
		  	<description>
- Package:LQFP80
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 7x		
- TSC: 16x	
			</description>			  
		    <feature type="Memory"   n="128" 	name="128KB Flash"/>	
		    <feature type="Memory"   n="80" 	name="80KB SRAM"/>	
			<feature type="IOs"      n="67"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x14000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x20000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x20000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>	
		</subFamily>  
		  <subFamily DsubFamily="N32G457">
                <processor Dclock="144000000"/>
                <description>
Up to 144MHz ARM Cortex-M4F, 512KB Flash, 144KB SRAM, 7xU(S)ART, 4xI2C, 3xSPI, 1xQSPI, USB 2.0 FS Device, RTC, 4x 12bit 5Msps ADC, 2x12bit DAC, 4xOPAMP, 7xComp, up to 24 Channels TSC, Hardware Cryptographic Engine.
                </description>				
                <compile header="firmware/CMSIS/device/n32g45x.h" define="N32G45X N32G455 USE_STDPERIPH_DRIVER"/>
		 <!-- *************************  Device 'N32G457MCL7'  ***************************** -->
		  <device Dname="N32G457MCL7"> 
		  	<description>
- Package:LQFP80
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 7x		
- TSC: 18x	
- DVP: 1x	
			</description>			  
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="67"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			<feature type="ETH"      n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>	
