vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G45x_DFP.pdsc
		 <!-- *************************  Device 'N32G457MEL7'  ***************************** -->
		  <device Dname="N32G457MEL7"> 
		  	<description>
- Package:LQFP80
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 7x		
- TSC: 18x	
- DVP: 1x	
			</description>			  
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="67"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			<feature type="ETH"      n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>	
		 <!-- *************************  Device 'N32G457VCL7'  ***************************** -->
		  <device Dname="N32G457VCL7"> 
		  	<description>
- Package:LQFP100
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 7x		
- TSC: 24x	
- DVP: 1x	
			</description>			  
		    <feature type="Memory"   n="256" 	name="256KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="80"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			<feature type="ETH"      n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x40000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x40000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>	
		 <!-- *************************  Device 'N32G457VEL7'  ***************************** -->
		  <device Dname="N32G457VEL7"> 
		  	<description>
- Package:LQFP100
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 7x		
- TSC: 24x	
- DVP: 1x	
			</description>			  
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="80"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			<feature type="ETH"      n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>	
		 <!-- *************************  Device 'N32G457QEL7'  ***************************** -->
		  <device Dname="N32G457QEL7"> 
		  	<description>
- Package:LQFP128
- QSPI: 1x	
- LCD Module
- OPAMP: 4x	
- COMP: 7x		
- TSC: 24x	
- DVP: 1x	
			</description>			  
		    <feature type="Memory"   n="512" 	name="512KB Flash"/>	
		    <feature type="Memory"   n="144" 	name="144KB SRAM"/>	
			<feature type="IOs"      n="97"     name="Input and Output Ports"/>
			<feature type="Timer"    n="8"/>
			<feature type="PWM"      n="24"/>				
			<feature type="ADC"      n="4"/>	
			<feature type="DAC"      n="2"/>	
			<feature type="USART"    n="3"/>	
			<feature type="UART"     n="4"/>	
		    <feature type="SPI"      n="3"/>	
			<feature type="I2C"      n="4"/>	
			<feature type="CAN"      n="2"/>
			<feature type="SDIO"     n="1"/>
			<feature type="ETH"      n="1"/>
			
			<memory id="IRAM1"   start="0x20000000" size="0x24000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x80000" default="1" startup="1"/>
			<algorithm name="Flash/N32G45x.FLM" start="0x08000000" size="0x80000" default="1"/>
			<debug svd="svd/N32G455.svd"/>	
          </device>		 
         </subFamily>		
        </family>
    </devices> 


    <conditions>   
		<!-- Compiler Conditions -->
        <!-- condition id="Compiler ARMCC">             
            <require Tcompiler="ARMCC"/>
        </condition -->
		
		<!-- Device Conditions -->
		<condition id="N32G45x">
		  <description>NSING N32G45x Devices</description> 
		  <require Dvendor="NSING:185" Dname="N32*"/> 
		</condition>
		
		<!-- Device + CMSIS Conditions -->
        <condition id="N32G45x CMSIS">            
		    <description>NSING N32G45x Device and the ARM compiler</description>
		    <require condition="N32G45x"/>
		    <require Tcompiler="ARMCC"/>
        </condition>

		<!-- N32G45x STDPERIPHERALS MISC Conditions -->
        <condition id="N32G45x STDPERIPHERALS">
            <description>NSING N32G45x Standard Peripherals drivers</description>
            <require condition="N32G45x CMSIS"/>
            <require Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="MISC"/>
        </condition>
		
		<!-- N32G45x STDPERIPHERALS RCC Conditions -->
        <condition id="N32G45x STDPERIPHERALS RCC">
            <description>NSING N32G45x Standard Peripherals driver with RCC</description>
            <require condition="N32G45x STDPERIPHERALS"/>
            <require Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="RCC"/>
        </condition>
		
		<condition id="N32G45x Algorithm Common" >
            <description>NSING N32G45x Series Algorithm Libraries Common Functions.</description>
            <require condition="N32G45x CMSIS"/>
            <require Cclass ="Device" Cgroup="Algorithm Libs" Csub="Common"/>
        </condition>

