vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G45x_DFP.pdsc
    </conditions>

    <components>
		<component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="N32G45x CMSIS">
            <description>Startup File for Nsing N32G45x Series</description>
            <files>
                <file category="include" name="firmware/CMSIS/device/"/>
				<file category="header" name="firmware/CMSIS/device/n32g45x.h"/>
				<!-- startup file -->				
                <file category="source" name="firmware/CMSIS/device/startup/startup_n32g45x.s" attr="config"  version="1.0.0" condition="N32G45x CMSIS"/>
				<!-- system file -->
                <file category="source" name="firmware/CMSIS/device/system_n32g45x.c" attr="config" version="1.0.0"/>
				
            </files>
        </component>
		
	    <!-- N32G45x_StdPeripherals -->		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="MISC" Cversion="1.0.0" condition="N32G45x CMSIS">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g45x_std_periph_driver/inc/"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/misc.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="ADC" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Analog-to-digital converter (ADC) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_adc.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_adc.c"/>
            </files>
        </component>		

        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="BKP" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Backup registers (BKPR) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_BKP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_bkp.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_bkp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="CAN" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Controller area network (CAN) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_can.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_can.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="COMP" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Comparator (COMP) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_COMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_comp.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_comp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="CRC" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>CRC calculation unit (CRC) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_crc.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_crc.c"/>
            </files>
        </component>
		
       <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="DBG" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>MCU debug component (DBG) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_dbg.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_dbg.c"/>
            </files>
        </component>
 
         <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="DAC" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Digital-to-analog converter (DAC) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DAC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_dac.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_dac.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="DMA" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>DMA controller (DMA) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_dma.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_dma.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="DVP" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Digital video port (DVP) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DVP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_dvp.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_dvp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>External interrupt/event controller (EXTI) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_exti.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_exti.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="ETH" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Ethernet MAC (ETH) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ETH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_eth.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_eth.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="FLASH" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Embedded Flash memory (FLASH) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_flash.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_flash.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>General-purpose I/O (GPIO) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_gpio.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_gpio.c"/>
            </files>
        </component>

<!--         <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="HDIV" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>High-speed divider (HDIV) interface driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_HDIV
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_hdiv.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_hdiv.c"/>
            </files>
        </component> -->
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Inter-integrated circuit (I2C) interface driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_i2c.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_i2c.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="IWDG" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Independent watchdog (IWDG) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_iwdg.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_iwdg.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="OPAMP" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Operational amplifier (OPAMP) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_OPAMP
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_opamp.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_opamp.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="PWR" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Power controller (PWR) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_pwr.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_pwr.c"/>
            </files>
        </component>

