vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G45x_DFP.pdsc
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="QSPI" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Queued SPI (QSPI) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_QSPI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_qspi.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_qspi.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="RCC" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Reset and clock control (RCC) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_rcc.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_rcc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="RTC" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Real-time clock (RTC) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_rtc.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_rtc.c"/>
            </files>
        </component>

        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="SDIO" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Secure digital (SDIO) interface driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SDIO
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_sdio.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_sdio.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="SPI" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Serial peripheral interface (SPI) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_spi.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_spi.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="TIMER" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Timers (TIMER) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_tim.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_tim.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="USART" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Universal asynchronous receiver transmitter (USART) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_usart.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_usart.c"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="WWDG" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>Window watchdog (WWDG) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_std_periph_driver/inc/n32g45x_wwdg.h"/>
                <file category="source" name="firmware/n32g45x_std_periph_driver/src/n32g45x_wwdg.c"/>
            </files>
        </component>		

        <component Cclass="Device" Cgroup="N32G45x_StdPeripherals" Csub="USBDEV" Cversion="1.0.0" condition="N32G45x STDPERIPHERALS RCC">
            <description>USB device (USBDEV) driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USBDEV
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g45x_usbfs_driver/inc/" />
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_core.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_def.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_init.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_int.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_lib.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_mem.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_regs.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_sil.h"/>
                <file category="header" name="firmware/n32g45x_usbfs_driver/inc/usb_type.h"/>
                <file category="source" name="firmware/n32g45x_usbfs_driver/src/usb_core.c"/>
                <file category="source" name="firmware/n32g45x_usbfs_driver/src/usb_init.c"/>
                <file category="source" name="firmware/n32g45x_usbfs_driver/src/usb_int.c"/>
                <file category="source" name="firmware/n32g45x_usbfs_driver/src/usb_mem.c"/>
                <file category="source" name="firmware/n32g45x_usbfs_driver/src/usb_regs.c"/>
                <file category="source" name="firmware/n32g45x_usbfs_driver/src/usb_sil.c"/>
            </files>
        </component>
		
		<component Cclass="Device" Cgroup="Algorithm Libs" Csub="Common" Cversion="1.0.0" condition="N32G45x CMSIS">
		    <description>Algo driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_COMMON
            </RTE_Components_h>
            <files>
                <!--file category="include" name="firmware/n32a455_algo_lib/inc"/ -->
                <file category="header" name="firmware/n32g45x_algo_lib/inc/n32g45x_algo_common.h"/>
                <file category="source" name="firmware/n32g45x_algo_lib/lib/n32g45x_algo_common.lib"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="AES" Cversion="1.0.0" condition="N32G45x Algorithm Common">
		    <description>AES driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_AES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_algo_lib/inc/n32g45x_aes.h"/>
                <file category="source" name="firmware/n32g45x_algo_lib/lib/n32g45x_aes.lib"/>
            </files>
        </component>
 
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="DES" Cversion="1.0.0" condition="N32G45x Algorithm Common">
		    <description>DES driver for N32G45x</description>		
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_DES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_algo_lib/inc/n32g45x_des.h"/>
                <file category="source" name="firmware/n32g45x_algo_lib/lib/n32g45x_des.lib"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="RNG" Cversion="1.0.0" condition="N32G45x Algorithm Common">
		    <description>RNG driver for N32G45x</description>
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_RNG
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_algo_lib/inc/n32g45x_rng.h"/>
                <file category="source" name="firmware/n32g45x_algo_lib/lib/n32g45x_rng.lib"/>
            </files>
        </component>
		
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="HASH" Cversion="1.0.0" condition="N32G45x Algorithm Common">
		    <description>HASH driver for N32G45x</description>		
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_HASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g45x_algo_lib/inc/n32g45x_hash.h"/>
                <file category="source" name="firmware/n32g45x_algo_lib/lib/n32g45x_hash.lib"/>
            </files>
        </component>	
		
    </components>
</package>
